In [46]:
import pandas as pd

In [47]:
df =pd.read_csv("students_data.csv")

In [48]:
df.head()

      name  age   city  math_score  english_score
0    Ahmed   23  Cairo          85             80
1     Sara   21   Giza          92             89
2     Omar   25   Alex          78             75
3     Mona   22  Cairo          88             91
4  Youssef   24   Giza          90             87

In [49]:
df.tail()

      name  age   city  math_score  english_score
3     Mona   22  Cairo          88             91
4  Youssef   24   Giza          90             87
5    Laila   20   Alex          95             93
6   Khaled   26  Cairo          70             72
7     Nour   23   Giza          84             86

In [50]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           8 non-null      str
 1   age            8 non-null      int64
 2   city           8 non-null      str
 3   math_score     8 non-null      int64
 4   english_score  8 non-null      int64
dtypes: int64(3), str(2)
memory usage: 452.0 bytes

In [51]:
df.shape

(8, 5)

In [52]:
df.describe()

         age  math_score  english_score
count   8.00    8.000000        8.00000
mean   23.00   85.250000       84.12500
std     2.00    8.084376        7.64269
min    20.00   70.000000       72.00000
25%    21.75   82.500000       78.75000
50%    23.00   86.500000       86.50000
75%    24.25   90.500000       89.50000
max    26.00   95.000000       93.00000

In [60]:
df["age"]

0    23
1    21
2    25
3    22
4    24
5    20
6    26
7    23
Name: age, dtype: int64

In [61]:
df[["age","math_score"]]

   age  math_score
0   23          85
1   21          92
2   25          78
3   22          88
4   24          90
5   20          95
6   26          70
7   23          84

In [57]:
df[(df["math_score"] > 85) & (df["age"] < 22)]

    name  age  city  math_score  english_score
1   Sara   21  Giza          92             89
5  Laila   20  Alex          95             93

In [69]:
df["n"]=df["age"] *9

In [73]:
df.sort_values("age", ascending=True)

      name  age   city  math_score  english_score    n
5    Laila   40   Alex          95             93  360
1     Sara   42   Giza          92             89  378
3     Mona   44  Cairo          88             91  396
0    Ahmed   46  Cairo          85             80  414
7     Nour   46   Giza          84             86  414
4  Youssef   48   Giza          90             87  432
2     Omar   50   Alex          78             75  450
6   Khaled   52  Cairo          70             72  468

In [76]:
df.isnull().sum()

name             0
age              0
city             0
math_score       0
english_score    0
n                0
dtype: int64

In [86]:
df.dropna(inplace=True)

In [87]:
df.fillna(0,inplace=False)

      name  age   city  math_score  english_score    n
0    Ahmed   46  Cairo          85             80  414
1     Sara   42   Giza          92             89  378
2     Omar   50   Alex          78             75  450
3     Mona   44  Cairo          88             91  396
4  Youssef   48   Giza          90             87  432
5    Laila   40   Alex          95             93  360
6   Khaled   52  Cairo          70             72  468
7     Nour   46   Giza          84             86  414

In [88]:
df.to_csv("my frist work.csv",index=False)